{
    "lang": "ru",
    "onclick_lang": {
        "ru": "",
        "class_ru": " is-info",
        "en": "href=\"/privacy-notice.html\"",
        "class_en": ""
    },
    "root-prefix": "/ru/",
    "article": {
        "title": "Уведомление о конфиденциальности",
        "short-description": "",
        "main-image": "",
        "link": "/ru/privacy-notice.html",
        "published": {
            "date": "2024-08-05",
            "text": "5 августа, 2024 года"
        },
        "content": "<p>CADBase управляет веб-сайтами на домене cadbase.rs и его поддоменах, которые предоставляют сервисы платформы CADBase.</p><p>Эта страница предназначена для информирования посетителей сайта о нашей политике в отношении сбора, использования и раскрытия личной информации, если кто-то решил воспользоваться платформой CADBase и связанными решениями (далее Сервисом).</p><p>Если вы решили воспользоваться Сервисом, то вы соглашаетесь со сбором и использованием информации в соответствии с данной политикой. Собираемая нами личная информация используется для предоставления и улучшения Сервиса. Мы не будем использовать или передавать вашу информацию кому-либо, за исключением случаев, описанных в настоящей Политике конфиденциальности.</p><p>Термины, используемые в настоящей Политике конфиденциальности, имеют те же значения, что и в наших Положения и условия, которые доступны по URL-адресу https://cadbase.rs/ru/privacy-notice.html, если только если иное не определено в настоящей Политике конфиденциальности.</p><h3>Сбор и использование информации</h3><p>Для улучшения качества пользования нашим Сервисом мы можем потребовать от вас предоставить нам определенную информацию, позволяющую установить личность, включая, в частности, ваше имя, номер телефона и почтовый адрес. Собранная нами информация будет использована для связи с вами или для установления вашей личности.</p><h3>Данные журнала</h3><p>Мы хотим сообщить вам, что каждый раз, когда вы посещаете наш Сервис, мы собираем информацию, которую ваш браузер отправляет нам и которая называется данными журнала. Эти данные могут включать в себя такую информацию, как адрес протокола Интернета (IP) вашего компьютера, версию браузера, страницы нашего Сервиса, которые вы посещаете, время и дату вашего посещения, время, проведенное на этих страницах, и другую статистику.</p><h3>Файлы cookie</h3><p>Cookies - это файлы с небольшим объемом данных, которые обычно используются в качестве анонимного уникального идентификатора. Они отправляются в ваш браузер с посещаемого вами сайта и хранятся на жестком диске вашего компьютера.</p><p>Наш сайт использует эти \"cookie\" для сбора информации и улучшения качества обслуживания. У вас есть возможность принять или отклонить эти файлы cookie, в местах их использования, а также знать, когда они отправляются на ваш компьютер. Если вы решите отказаться от использования файлов \"cookie\", вы, возможно, не сможете пользоваться некоторыми разделами нашего Сервиса.</p><h3>Поставщики услуг</h3><p>Мы можем нанимать сторонние компании и частных лиц по следующим причинам:</p><ul><li>для содействия в предоставлении наших Услуг;</li><li>для предоставления Услуги от нашего имени;</li><li>для выполнения связанных с Сервисом услуг;</li><li>для анализа того, как используется и работает Сервис.</li></ul><p>Мы хотим проинформировать пользователей нашего Сервиса о том, что эти третьи лица имеют доступ к вашей Персональной информации. Это необходимо для выполнения задач, поставленных перед ними от нашего имени. Однако они обязуются не разглашать и не использовать эту информацию в иных целях.</p><h3>Безопасность</h3><p>Мы ценим ваше доверие в предоставлении нам вашей личной информации, поэтому стараемся использовать коммерчески приемлемые средства ее защиты. Однако помните, что ни один способ передачи данных через Интернет или способ электронного хранения не является на 100% безопасным и надежным, и мы не можем гарантировать их абсолютную безопасность.</p><h3>Ссылки на другие сайты</h3><p>Наш Сервис может содержать ссылки на другие сайты. Если вы нажмете на ссылку третьего лица, вы будете направлены на этот сайт. Обратите внимание, что эти внешние сайты не управляются нами. Поэтому мы настоятельно рекомендуем вам ознакомиться с политикой конфиденциальности этих сайтов. Мы не контролируем и не несем ответственности за содержание, политику конфиденциальности или практику использования сторонних сайтов или сервисов.</p><h3>Конфиденциальность детей</h3><p>Наши Услуги не предназначены для лиц моложе 13 лет. Мы не собираем сознательно персональную информацию, идентифицирующую детей младше 13 лет. В случае если мы обнаружим, что ребенок младше 13 лет предоставил нам личную информацию, мы немедленно удалим ее с наших серверов. Если вы являетесь родителем или опекуном и вам известно, что ваш ребенок предоставил нам личную информацию, пожалуйста, свяжитесь с нами, чтобы мы могли предпринять необходимые действия.</p><h3>Изменения в Политике конфиденциальности</h3><p>Мы можем время от времени обновлять нашу Политику конфиденциальности. Поэтому мы советуем вам периодически просматривать эту страницу на предмет изменений. Мы будем уведомлять вас о любых изменениях, публикуя новую Политику конфиденциальности на этой странице. Эти изменения вступают в силу немедленно после их размещения на этой странице.</p><h3>Свяжитесь с нами</h3><p>Если у вас есть вопросы или предложения по нашей Политике конфиденциальности, не стесняйтесь обращаться к нам.</p>"
    },
    "platform": "Платформа",
    "about-us": {
        "title": "Платформа"
    },
    "api": {
        "title": "API"
    },
    "features": {
        "title": "Преимущества"
    },
    "overviews": {
        "title": "Обзоры"
    },
    "terms": {
        "title": "Условия"
    },
    "api-reference": "Справочник по API",
    "privacy-notice": "Уведомление о конфиденциальности",
    "language": {
        "english": "Английский",
        "russian": "Русский"
    },
    "link-titles": {
        "youtube": "YouTube канал",
        "gitlab": "Исходные коды CADBase"
    },
    "resources": {
        "images": "./../images",
        "css": "./../css",
        "js": "./../js"
    }
}