{
    "lang": "ru",
    "onclick_lang": {
        "ru": "",
        "class_ru": " is-info",
        "en": "href=\"/\"",
        "class_en": ""
    },
    "cadbase": {
        "title": "CADBase - Делаем настоящее лучше",
        "short-description": "Платформа для публикации и обмена информацией о чертежах и производителях.",
        "slogan": "Делаем настоящее лучше"
    },
    "platform": "Платформа",
    "about-us": {
        "title": "Платформа",
        "subtitle": "для инженеров и поставщиков",
        "text": "Платформа обладает функциональностью для организации совместной инженерной работы, обмена компонентами между пользователями, поддерживает версионирование файлов САПР, дифференцированный доступ к данным, каталоги поставщиков с 2D-чертежами, 3D-моделями и сопроводительной документацией."
    },
    "cad-integrations": {
        "title": "Интеграция с САПР",
        "content": "Возможность доступа и обновления деталей на платформе с помощью систем автоматизированного проектирования, моделирования и симуляции, используемых инженерами и конструкторами.",
        "example": "Демонстрация интеграций с FreeCAD и Blender 3D на"
    },
    "3d-viewer": "3D Просмотрщик",
    "api": {
        "title": "API",
        "content": "Программный интерфейс инженерной платформы, доступный всем пользователям, позволяет реализовывать индивидуальные решения по автоматизации.",
        "example": "Запрос для создания пользователя через"
    },
    "features": {
        "title": "Преимущества",
        "subtitle": "В чем преимущество платформы обмена инженерными данными?",
        "item-first": [
            {
                "title": "Для инжиниринговых компаний",
                "content": "Доступ к актуальным каталогам поставщиков с 3D-моделями и документацией, а также к информации о поставщиках базовых компонентов. Поиск альтернативных поставщиков и подбор компонентов по характеристикам."
            },
            {
                "title": "Для поставщиков комплектующих",
                "content": "Публикация каталогов производителей, содержащих чертежи, 3D-модели и материалы, необходимые заказчикам, обеспечивающая своевременную доставку обновлений каталога и информации о выпуске продукции заказчикам."
            }
        ],
        "item-second": [
            {
                "title": "Для инженеров и конструкторов",
                "content": "Интеграция CADBase с САПР упрощает использование 3D-моделей и чертежей из каталогов поставщиков, позволяя добавлять детали в рабочее пространство САПР, сокращая объем рутинной работы."
            },
            {
                "title": "Для дизайнеров и творческих людей",
                "content": "Платформа обеспечивает хранение инженерных проектов, файлов САПР и сопутствующих данных, а также эффективную систему контроля версий. Интеграция с САПР позволяет пользователям оперативно загружать данные в хранилище платформы и получать их через САПР."
            }
        ]
    },
    "btn-open-platform": "Открыть платформу",
    "overviews": {
        "title": "Обзоры",
        "subtitle": "Учебные пособия и статьи",
        "item": [
            {
                "title": "Ценность платформы CADBase для творцов и инженеров",
                "item-tags": [
                    {
                        "level": "is-default",
                        "tag": "обзор"
                    }
                ],
                "image": {
                    "link": "./../images/ow_concept_mini_ru.webp",
                    "alt": "концепция платформы для инженеров"
                },
                "action": {
                    "link": "/ru/platform-for-creators-and-engineers.html",
                    "text": "Читать"
                }
            }
        ]
    },
    "nothing": "Ничего",
    "terms": {
        "title": "Условия",
        "subtitle": "Мы очень рады, что вы здесь",
        "content": "Пожалуйста, внимательно прочитайте данное соглашение об условиях обслуживания перед тем, как получить доступ или использовать CADBase. Поскольку это очень важный договор между нами и нашими пользователями, мы должны сделать его как можно более понятным:",
        "body": "ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ \"КАК ЕСТЬ\", БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ, ЯВНЫХ ИЛИ ПОДРАЗУМЕВАЕМЫХ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ ГАРАНТИЯМИ ТОВАРНОГО СОСТОЯНИЯ, ПРИГОДНОСТИ ДЛЯ КОНКРЕТНОЙ ЦЕЛИ И НЕНАРУШЕНИЯ ПРАВ. НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ АВТОРЫ ИЛИ ПРАВООБЛАДАТЕЛИ НЕ НЕСУТ ОТВЕТСТВЕННОСТИ ЗА ЛЮБЫЕ ПРЕТЕНЗИИ, УБЫТКИ ИЛИ ДРУГИЕ ОБЯЗАТЕЛЬСТВА, БУДЬ ТО ДОГОВОРНЫЕ, ДЕЛИКТНЫЕ ИЛИ ИНЫЕ, ВОЗНИКАЮЩИЕ ИЗ ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ, В СВЯЗИ С НИМ ИЛИ В РЕЗУЛЬТАТЕ ЕГО ИСПОЛЬЗОВАНИЯ ИЛИ ДРУГИХ ОПЕРАЦИЙ С НИМ."
    },
    "api-reference": "Справочник по API",
    "privacy-notice": "Уведомление о конфиденциальности",
    "language": {
        "english": "Английский",
        "russian": "Русский"
    },
    "link-titles": {
        "youtube": "YouTube канал",
        "gitlab": "Исходные коды CADBase"
    },
    "resources": {
        "images": "./../images",
        "css": "./../css",
        "js": "./../js"
    }
}