{
    "cadbase": {
        "title": "CADBase - Welcome",
        "short-description": "The platform for publishing and sharing information about drawings and manufacturers.",
        "slogan": "Making the present better"
    },
    "platform": "Platform",
    "about-us": {
        "title": "Platform",
        "subtitle": "for engineers and suppliers",
        "text": "When organising collaborative engineering work, a platform that supports CAD file versioning, differentiated data access, verified supplier catalogues with 3D models and supporting documentation is a useful solution."
    },
    "cad-integrations": {
        "title": "CAD Integrations",
        "content": "One valuable feature is the capability to access and refresh parts on the platform through computer-aided design systems utilised by engineers and designers.",
        "example": "Demonstration of integration with FreeCAD on"
    },
    "3d-viewer": "3D Viewer",
    "api": {
        "title": "API",
        "content": "The engineering platform's API, accessible to all users, enables them to create bespoke solutions for automating business processes and presenting data.",
        "example": "Request for user creation via"
    },
    "features": {
        "title": "Features",
        "subtitle": "What is the advantage of an engineering data sharing platform?",
        "item-first": [
            {
                "title": "For engineering companies",
                "content": "Access to verified supplier catalogues with 3D models and documentation, and information on suppliers of basic components. Search for alternative suppliers and match components by characteristics."
            },
            {
                "title": "For component suppliers",
                "content": "Publish manufacturer catalogues containing drawings, 3D models and materials required by customers, enabling timely delivery of catalogue updates and product release information to customers."
            }
        ],
        "item-second": [
            {
                "title": "For engineers and constructors",
                "content": "Integration of CADBase with CAD simplifies the use of 3D models and drawings from supplier catalogues, allowing parts to be added to the CAD workspace, reducing routine work."
            },
            {
                "title": "For designers and creators",
                "content": "The platform offers storage for engineering projects, CAD files and associated data, along with a thorough version control system. CAD integration enables users to upload data promptly to the platform's storage and retrieve it through CAD."
            }
        ]
    },
    "btn-open-platform": "Open CADBase",
    "overviews": {
        "title": "Overviews",
        "subtitle": "Training manuals and articles"
    },
    "nothing": "Nothing",
    "terms": {
        "title": "Terms",
        "subtitle": "We're really happy you're here",
        "content": "Please read this Terms of Service agreement carefully before accessing or using CADBase. Because it is such an important contract between us and our users, we need to make it as clear as possible:",
        "body": "THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE."
    },
    "api-reference": "API reference",
    "language": {
        "english": "English",
        "russian": "Russian"
    },
    "link-titles": {
        "youtube": "YouTube Channel",
        "gitlab": "CADBase Source Codes"
    }
}