{
    "cadbase": {
        "title": "CADBase - Добро пожаловать",
        "short-description": "Платформа для публикации и обмена информацией о чертежах и производителях.",
        "slogan": "Делаем настоящее лучше"
    },
    "platform": "Платформа",
    "api": "API",
    "about-us": {
        "title": "Платформа",
        "subtitle": "для инженеров и поставщиков",
        "text": "При организации совместной инженерной работы полезным решением является платформа, поддерживающая версионирование файлов САПР, дифференцированный доступ к данным, верифицированные каталоги поставщиков с 3D-моделями и сопроводительной документацией."
    },
    "cad-integrations": {
        "title": "Интеграция с САПР",
        "content": "Возможность доступа и обновления деталей на платформе с помощью систем автоматизированного проектирования, используемых инженерами и конструкторами."
    },
    "3d-viewer": "3D Просмоторщик",
    "api-content": "Программный интерфейс инженерной платформы, доступный всем пользователям, позволяет реализовывать собственные решения по автоматизации бизнес-процессов и представлению данных.",
    "features": {
        "title": "Преимущества",
        "subtitle": "В чем преимущество платформы обмена инженерными данными?",
        "item-first": [
            {
                "title": "Для инжиниринговых компаний",
                "content": "Доступ к актуальным каталогам поставщиков с 3D-моделями и документацией, а также к информации о поставщиках базовых компонентов. Поиск альтернативных поставщиков и подбор компонентов по характеристикам."
            },
            {
                "title": "Для поставщиков комплектующих",
                "content": "Публикация каталогов производителей, содержащих чертежи, 3D-модели и материалы, необходимые заказчикам, обеспечивающая своевременную доставку обновлений каталога и информации о выпуске продукции заказчикам."
            }
        ],
        "item-second": [
            {
                "title": "Для инженеров и конструкторов",
                "content": "Интеграция CADBase с САПР упрощает использование 3D-моделей и чертежей из каталогов поставщиков, позволяя добавлять детали в рабочее пространство САПР, сокращая объем рутинной работы."
            },
            {
                "title": "Для дизайнеров и творческих людей",
                "content": "Платформа обеспечивает хранение инженерных проектов, файлов САПР и сопутствующих данных, а также эффективную систему контроля версий. Интеграция с САПР позволяет пользователям оперативно загружать данные в хранилище платформы и получать их через САПР."
            }
        ]
    },
    "resume": {
        "title": "Веб-приложение платформы",
        "subtitle": "Для правильной работы ваш браузер должен поддерживать WebAssembly (Wasm) и JavaScript (используется importmap). Пожалуйста, проверьте, поддерживает ли ваш браузер эти функции."
    },
    "btn-open-platform": "Открыть платформу CADBase",
    "overviews": {
        "title": "Обзоры",
        "subtitle": "Учебные пособия и статьи"
    },
    "nothing": "Ничего",
    "terms": {
        "title": "Условия",
        "subtitle": "Мы очень рады, что вы здесь",
        "content": "Пожалуйста, внимательно прочитайте данное соглашение об условиях обслуживания перед тем, как получить доступ или использовать CADBase. Поскольку это очень важный договор между нами и нашими пользователями, мы должны сделать его как можно более понятным:",
        "body": "ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ \"КАК ЕСТЬ\", БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ, ЯВНЫХ ИЛИ ПОДРАЗУМЕВАЕМЫХ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ ГАРАНТИЯМИ ТОВАРНОГО СОСТОЯНИЯ, ПРИГОДНОСТИ ДЛЯ КОНКРЕТНОЙ ЦЕЛИ И НЕНАРУШЕНИЯ ПРАВ. НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ АВТОРЫ ИЛИ ПРАВООБЛАДАТЕЛИ НЕ НЕСУТ ОТВЕТСТВЕННОСТИ ЗА ЛЮБЫЕ ПРЕТЕНЗИИ, УБЫТКИ ИЛИ ДРУГИЕ ОБЯЗАТЕЛЬСТВА, БУДЬ ТО ДОГОВОРНЫЕ, ДЕЛИКТНЫЕ ИЛИ ИНЫЕ, ВОЗНИКАЮЩИЕ ИЗ ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ, В СВЯЗИ С НИМ ИЛИ В РЕЗУЛЬТАТЕ ЕГО ИСПОЛЬЗОВАНИЯ ИЛИ ДРУГИХ ОПЕРАЦИЙ С НИМ."
    },
    "api-reference": "Справочник по API",
    "language": {
        "english": "Английский",
        "russian": "Русский"
    }
}