{
    "lang": "ru",
    "onclick_lang": {
        "ru": "",
        "class_ru": " is-info",
        "en": "href=\"/platform-for-creators-and-engineers.html\"",
        "class_en": ""
    },
    "root-prefix": "/ru/",
    "article": {
        "title": "Ценность платформы CADBase для творцов и инженеров",
        "short-description": "В статье представлен общий обзор истории создания платформы для обмена 3D-моделями и чертежами, а также сопроводительной документацией. Затрагиваются вопросы управления данными об изделии, организации каталогов продукции и взаимодействия между заказчиками и поставщиками.",
        "main-image": "./../images/full_logo.svg",
        "link": "/platform-for-creators-and-engineers.html",
        "published": {
            "date": "2024-06-27",
            "text": "27 июня, 2024 года"
        },
        "content": "<img src=\"./../images/ow_concept_mini_ru.webp\" alt=\"Концептуальное описание платформы обмена инженерными данными\" /><p>Разработка платформы CADBase ведётся с 2018 года. Название платформы образовано путём соединения двух слов CAD (САПР) и Base (База), условно «САПРБаза». Такое наименование описывает платформу как «База данных для систем автоматизированного проектирования» (CAD Data Base).</p><p>Основной задачей платформы CADBase является обеспечение обмена 3D-моделями, чертежами и сопутствующей информацией: сопроводительной документацией, каталогами производителей с информацией о поставщиках, сертификатами, документами по стандартизации и классификации.</p><p>Идея совместного доступа к проектам из различных программ не нова, и уже существуют решения для интеграций между <abbr title=\"Системы автоматизированного проектирования\">САПР</abbr>, <abbr title=\"Системы управления данными о продукте\">PDM</abbr>, <abbr title=\"Системы управления жизненным циклом продукта\">PLM</abbr> и <abbr title=\"Системы управления цепочками поставок\">SCM</abbr>. С точки зрения бизнеса, платформа CADBase ориентирована на производственные предприятия и инжиниринговые компании. В перспективе использование платформы упростит процесс поиска поставщиков и подбора аналогов, позволяя потенциальным заказчикам оперативно получать информацию о производителе и его продукции.</p><p>Запуск платформы с минимальным функционалом состоялся в январе 2022 года. Основными пользователями платформы стали люди, которым требуется внешнее хранилище для результатов интеллектуального труда, те, кому не хватает возможностей облачного диска и нужен более широкий функционал, с каталогами моделей, 3D просмотрщиком и контролем версий файлов. Учитывая запросы пользователей, были реализованы интеграции с <a href=\"https://www.freecad.org/\" title=\"Сайт FreeCAD\" rel=\"noopener noreferrer\" target=\"_blank\">FreeCAD</a> (бесплатная параметрическая САПР) и <a href=\"https://extensions.blender.org/add-ons/cadbase-library/\" title=\"Страница дополнения «Библиотека CADBase» для Blender 3D\" rel=\"noopener noreferrer\" target=\"_blank\">Blender 3D</a> (бесплатная программа для создания трёхмерной компьютерной графики).</p><h3 class=\"has-text-centered\">Устройство платформы CADBase</h3><p>Основным объектом платформы является «Компонент». При просмотре компонента на сайте платформы, отображается следующая информация:</p><ul><li>атрибуты и файлы компонента</li><li>модификации компонента и их файлы</li><li>наборы файлов для модификаций компонента (группировка файлов)</li><li>связанные с компонентом стандарты (опубликованные на платформе)</li><li>информация о производителе или поставщиках компонента</li><li>связанные с компонентом каталоги</li></ul><p>В настоящее время сайт платформы доступен на русском и английском языках. Планируется добавить китайский и испанский. В целом, чем больше локализаций — тем лучше, по мере появления запросов или желающих поддерживать их актуальность, будут добавляться новые.</p><h3 class=\"has-text-centered\">Преимущественные отличия CADBase от аналогов</h3><p>Наличие схожих с платформой CADBase продуктов, делает необходимым постоянный поиск улучшений и инноваций. Уже сейчас платформа CADBase объединяет в себе ряд преимуществ:</p><dl><dt><strong>Простая интеграция со сторонними сервисами</strong></dt><dd>Для определения компонентов и данных из сторонних программ, с которыми нужно взаимодействовать, используются избранные компоненты пользователя и наборы файлов. К примеру, при работе через верстак CADBase Library в FreeCAD, у пользователя будут обновлены только необходимые данные.</dd><dt><strong>Создание сайтов на базе платформы CADBase</strong></dt><dd>С брендированием, добавлением калькуляции продукции и созданием дополнений для других программ, в том числе с ограниченным доступом к API. Этому способствует доступ к API сервера платформы по токену авторизации (любого) пользователя платформы, а также распространение исходных кодов платформы и связанных проектов под свободными лицензиями.</dd><dt><strong>Наличие системы <abbr title=\"Управление версиями файлов\">версионирования файлов</abbr></strong></dt><dd>Контроль версий файлов может помочь пользователям и организациям улучшить стратегии управления данными. Создание новой версии происходит при загрузке файла, наименование которого совпадает с загруженным ранее. Активная <abbr title=\"ревизия\">версия</abbr> файла может быть изменена как в сторону более младшей, так и в сторону более старшей версии. В некоторых случаях пользователи предпочитают сохранять определённые версии.</dd><dt><strong>Дифференцированный доступ</strong></dt><dd>Функционал разграничения доступа на чтение и запись позволяет предоставить одним пользователям доступ с правами на изменение, а другим только на чтение. В случае выдачи доступа для компании, её участники получат доступ, в зависимости от их ролей в компании.</dd><dt><strong>Компонент содержит информацию о производителе или поставщиках</strong></dt><dd>Это позволяет компаниям, поставляющим стандартные и типовые изделия, «добавляться» в списки поставщиков компонентов.</dd></dl>",
        "conclusion": "Благодарим за интерес к платформе CADBase!",
        "next": "",
        "reference-materials": [
            {"material-item": "Системы автоматизированного проектирования (аббревиатура САПР; англ. CAD - Computer-aided design; CADD - Computer-aided design and drafting) — класс программного обеспечения для создания 3D моделей и чертежей, а так же конструкторской и технологической документации."},
            {"material-item": "Product Data Management (аббревиатура PDM) — системы управления данными о продукте (изделии). Программное обеспечение для автоматизации хранения данных и документов, управления структурой продукта и процессами работ."},
            {"material-item": "Product Lifecycle Management (аббревиатура PLM) — системы управления жизненным циклом продукта (изделия). Этот класс программного обеспечения управляет информацией и процессами на каждом этапе жизненного цикла продукта с момента выявления потребности до его утилизации."},
            {"material-item": "Supply Chain Management (аббревиатура SCM) — системы управления цепочками поставок. Программное обеспечение для сквозного управления цепями поставок, упрощающий процесс оптимизации логистики и закупок."}
        ]
    },
    "platform": "Платформа",
    "about-us": {
        "title": "Платформа"
    },
    "api": {
        "title": "API"
    },
    "features": {
        "title": "Преимущества"
    },
    "overviews": {
        "title": "Обзоры"
    },
    "terms": {
        "title": "Условия"
    },
    "api-reference": "Справочник по API",
    "privacy-notice": "Уведомление о конфиденциальности",
    "language": {
        "english": "Английский",
        "russian": "Русский"
    },
    "link-titles": {
        "youtube": "YouTube канал",
        "gitlab": "Исходные коды CADBase"
    },
    "resources": {
        "images": "./../images",
        "css": "./../css",
        "js": "./../js"
    }
}